scripts/putida_stir_small/trans_test/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue putida.liquid 0
);

regions
(
    boxToCell
    {
        box (-1.0 0.0 -1.0) (1.0 0.06749 1.0);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0.01
            volScalarFieldValue alpha.liquid 0.99
        );
    }
    boxToCell
    {
        box (-0.005 0.03 -0.02625) (0.005 0.035 -0.01625);
        fieldValues
        (
            volScalarFieldValue putida.liquid 0.9
        );
    }
);


// ************************************************************************* //
